import Template from "@/components/EventsTemplate";
import Footer from "@/components/Footer";
import Header from "@/components/Header";

export default function Scholarships() {
  const ProgramsData = [
    {
      title: "Research Science Institute (RSI)",
      description:
        "\
        يستهدف البرنامج .(MIT) هو برنامج بحث علمي صيفي متميز ُيعقد في معهد ماساتشوستس للتكنولوجيا (RSI) برنامج\
        الطالب الموهوبين في المدارس الثانوية الذين تتراوح أعمارهم بين 15 و19 عا ًما. يهدف البرنامج إلى تطوير مهارات\
        يشترط على المتقدمين تقديم طلب شامل .(STEM) البحث واإلبداع في مجاالت العلوم والتكنولوجيا والهندسة والرياضيات\
        يتضمن توصيات مدرسية. يتمكن الطالب من إجراء أبحاث علمية حقيقية تحت إشراف باحثين محترفين، مما يوفر لهم تجربة\
        .تعليمية فريدة من نوعها. يفتح التسجيل في نوفمبر وينتهي في يناير\
      ",
      linkLabel: "Program Link",
      linkUrl: "http://www.cee.org/research-science-institute",
    },
    {
      title: "Young Scholars Program (YYAS)",
      description:
        "\
        هو برنامج صيفي يهدف إلى تعزيز المهارات األكاديمية واالجتماعية للطالب في المدارس الثانوية، YYAS برنامج\
        ويستهدف الفئة العمرية من 15 إلى 18 عا ًما. يتطلب البرنامج تقديم طلب شامل مع توصيات مدرسية. يشمل البرنامج ورش\
        عمل ونقاشات تفاعلية حول مواضيع متنوعة، مما يعزز التفكير النقدي ويمنح الطالب الفرصة لبناء عالقات جديدة وتوسيع آفاقهم\
        .يبدأ التدريب عادة في بداية السنة الجديدة وينتهي في أبريل\
      ",
      linkLabel: "Program Link",
      linkUrl: "hhttps://africanscholars.yale.edu/admissions/how-applym",
    },
    {
      title: "Lumiere",
      description:
        "\
        هو برنامج صيفي يركز على تعزيز التفكير النقدي واإلبداع لدى طالب المدارس الثانوية الذين تتراوح Lumiere برنامج\
        لطالب الثانوي. يتطلب البرنامج تقديم طلب يتضمن معلومات شخصية وأكاديمية. يشمل البرنامج مجموعة متنوعة من\
        األنشطة التعليمية، بما في ذلك مشاريع تعليمية وورش عمل تفاعلية، مما يساعد الطالب على تطوير مهارات جديدة. يفتح التسجيل\
        .عادة في مارس وينتهي في مايو\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://www.lumiere-education.com/",
    },
    {
      title: "Pioneer",
      description:
        "\
        هو برنامج صيفي قيادي يهدف إلى تطوير مهارات القيادة والتواصل لدى الطالب في المدارس الثانوية، Pioneer برنامج\
        لطالب الثانويه . يجب على المتقدمين تقديم طلب يوضح اهتماماتهم ومهاراتهم الشخصية. يوفر البرنامج أنشطة متنوعة\
        .تساعد الطالب على االستعداد لمستقبل مهني ناجح. يبدأ التسجيل عا ًدة في يناير وينتهي في مارس\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://apply.pioneeracademics.com/portal/apply",
    },
    {
      title: "Indigo",
      description:
        "\
        هو برنامج بحث علمي يستهدف الطالب في المدارس الثانوية الذين تتراوح أعمارهم بين 14 و18 عا ًما. Indigo برنامج\
        يهدف البرنامج إلى تقديم فرص بحثية متميزة وتعزيز التفكير النقدي. يتطلب البرنامج تقديم طلب يتضمن معلومات أكاديمية\
        وشخصية. يتعاون الطالب مع باحثين وخبراء لتطوير مشاريع خاصة، مما يساعد على توسيع معرفتهم وتجربتهم األكاديمية.\
        .يفتح التسجيل في فبراير وينتهي في أبريل\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://www.indigoresearch.org/apply",
    },
    {
      title: "Horizon",
      description:
        "\
        هو برنامج تعليمي ميداني يهدف إلى استكشاف مجاالت جديدة وتطوير المهارات العملية لدى طالب Horizon برنامج\
        المدارس الثانوية الذين تتراوح أعمارهم بين 14 و18 عا ًما. يشترط تقديم طلب يتضمن االهتمامات األكاديمية. يتضمن\
        عا في ديسمبر ًدة البرنامج ورش عمل ونشاطات ميدانية، ويتطلب تقديم طلب يتضمن االهتمامات األكاديمية. يفتح التسجيل\
        .وينتهي في مارس\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://www.horizoninspires.com/",
    },
    {
      title: "Sakura",
      description:
        "\
        هو برنامج ثقافي وتعليمي يهدف إلى تعزيز الفهم الثقافي والعلمي بين الطالب. يستهدف البرنامج طالب Sakura برنامج\
        المدارس الثانوية من 15 إلى 18 عا ًما. يشترط تقديم طلب شامل مع توصيات مدرسية، ويشمل زيارات ميدانية ومحاضرات\
        .حول مواضيع متعددة. يبدأ التسجيل عا ًدة في يناير وينتهي في مايو\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://ssp.jst.go.jp/",
    },
    {
      title: "Program in Mathematics for Young Scientists(PROMYS)",
      description:
        "\
        هو برنامج صيفي مخصص للطالب الموهوبين في الرياضيات، حيث يركز على تعزيز التفكير PROMYS برنامج\
        الرياضي واإلبداع. يستهدف البرنامج الطالب من 14 إلى 18 عا ًما، ويتطلب تقديم طلب يتضمن معلومات أكاديمية. يقدم\
        البرنامج بيئة تعليمية غامرة، حيث يتفاعل الطالب مع المعلمين والباحثين في مجاالت الرياضيات المختلفة. يفتح التسجيل\
        .عا في يناير وينتهي في مارس\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://promys.org/",
    },
    {
      title: "Ross Mathematics Program",
      description:
        "\
        برنامج روس للرياضيات هو برنامج صيفي مكثف ُيقام في جامعة أوهايو ويهدف إلى توفير بيئة تعليمية غامرة للطالب\
        الموهوبين في الرياضيات. يركز البرنامج على التحديات والمسائل الرياضية المتقدمة، مما يتيح للطالب فرصة تطوير\
        مهاراتهم وتحفيز شغفهم للرياضيات. يجب على المتقدمين تقديم طلب يتضمن معلومات أكاديمية وتوصيات مدرسية. يفتح\
        . عادة في ديسمبر وينتهي في فبراير\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://rossprogram.org/participants/application",
    },
    {
      title: "ESPR",
      description:
        "\
        هو برنامج علمي مخصص لطالب المدارس الثانوية المهتمين في مجاالت العلوم والتكنولوجيا والهندسة ESPR برنامج\
        يركز البرنامج على تطوير مهارات البحث والتفكير النقدي من خالل مشروعات عملية وتعاون مع .(STEM (والرياضيات\
        .باحثين ومؤسسات أكاديمية. يتطلب التسجيل تقديم طلب يتضمن معلومات أكاديمية. يفتح التسجيل عا ًدة في أوائل الربيع\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://espr.org/",
    },
    {
      title: "New York Junior Academy",
      description:
        "\
        هو برنامج صيفي يهدف إلى تقديم تجربة تعليمية غنية للطالب في مجالات Junior Academy York New برنامج\
        العلوم والفنون. يستهدف البرنامج طالب المدارس الثانوية ويتيح لهم الفرصة للتعلم من خالل ورش عمل وتجارب عملية.\
        .يجب على المتقدمين تقديم طلب يتضمن معلومات أكاديمية وبيانات شخصية. يفتح التسجيل عا ًدة في فبراير وينتهي في أبريل\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://gsa.smapply.io/prog/",
    },
    {
      title: "NASA SEES Intern Program",
      description:
        "\
        يتعاون هذا البرنامج مع وكالة ناسا ويستهدف طالب الثانوية من 16 سنة فأكثر. يمنح البرنامج المشاركين فرصة للعمل على\
        مشاريع بحثية تتعلق باألرض والفضاء، ويعتمد على مهارات قوية في العلوم والتكنولوجيا. يتم قبول الطالب بنا ًء على سجلهم\
        األكاديمي وطلب يتضمن استعرا ًضا الهتماماتهم ومهاراتهم\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://science.nasa.gov/",
    },
    {
      title: "Stanford Institutes of Medicine Summer Research Program (SIMR)",
      description:
        "\
        يوفر برنامج SIMR للطالب من 16 إلى 18 سنة الفرصة للعمل في أبحاث طبية متقدمة تحت إشراف علماء وأطباء في\
        جامعة ستانفورد. يركز البرنامج على األبحاث المتعلقة بالصحة العامة وعلوم األحياء الطبية، ويتطلب سجاًل أكاديمًيا مميزا\
        وخلفية قوية في العلوم ويتنتهي فتره التقديم في 22 فبراير.\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://simr.stanford.edu/application.html",
    },
    {
      title: "Garcia Summer Scholars Program",
      description:
        "\
        يوفر هذا البرنامج، الذي يستهدف طالب الثانوية 18-14 سنة، فرصة للعمل على أبحاث متقدمة في مجال علوم المواد\
        والهندسة. يقام البرنامج في جامعة ستوني بروك ويشمل تدريًبا معملًيا متقدًما في بيئة بحثية أكاديمية. يتطلب التقديم إلي البرنامج\
        سجاًل أكاديمًيا مميزا وخطاب توصية. \
      ",
      linkLabel: "Program Link",
      linkUrl: "https://www.stonybrook.edu/",
    },
    {
      title: "Polygence Core Program",
      description:
        "\
        هو برنامج بحثي مصمم للطالب بين 13 و18 عا ًما، ويهدف إلى مساعدة الشباب في تطوير مشاريع بحثية\
        مخصصة بنا ًء على اهتماماتهم الشخصية. يتعاون الطالب مع مرشدين خبراء في مجاالت متنوعة، ويتيح لهم البرنامج إنتاج\
        قا بحثية، تطبيقات، أو حتى نماذج أولية. يتطلب التقديم للبرنامج تقديم طلب ومقابلة قصيرة\
        مشاريع فريدة، س ً واء كانت أوراً\
        لتقييم اهتمامات الطالب وأهدافه البحثية\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://app.polygence.org/dashboard",
    },
    {
      title: "Young Scientists Journal",
      description:
        "\
        هي مجلة علمية دولية يقودها الشباب، وتستهدف الطالب الذين تتراوح أعمارهم بين 12 و20 عا ًما ممن لديهم شغف بالبحث\
        العلمي. تتيح المجلة للشباب فرصة نشر أبحاثهم األصلية، مما يساعدهم على اكتساب خبرة عملية في كتابة وتحرير ونشر\
        األوراق العلمية. تقدم YSJ برنامج بحثي يمتد لثمانية أسابيع، حيث يتعاون الطالب مع مرشدين متخصصين إلجراء دراسات\
        في مجاالت علمية متنوعة، مع إمكانية نشر نتائج أبحاثهم في المجلة ويكون نشط خالل الصيف\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://www.ys-journal.org/our_program",
    },
    {
      title: "Research Internships in Science and Engineering (RISE)",
      description:
        "\
        هو برنامج رائد مخصص للطالب الدوليين الراغبين في تطوير مهاراتهم البحثية في مجاالت العلوم والهندسة. يتيح هذا\
        البرنامج للطالب فرصة للعمل في مختبرات أكاديمية وصناعية في ألمانيا، مما يساعدهم على اكتساب خبرة عملية قيمة.\
        يستهدف البرنامج بشكل أساسي الطالب الجامعيين، ويتضمن دع ًما مالًيا يغطي تكاليف السفر واإلقامة. يهدف البرنامج إلى\
        تعزيز التعاون الدولي في مجال البحث العلمي وتوفير بيئة تعليمية مبتكرة.\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://www.daad.de/rise/en/rise-germany/",
    },
    {
      title: "CERN Summer Student Program",
      description: "CERN Summer Student Program",
      linkLabel: "Program Link",
      linkUrl: "https://careers.smartrecruiters.com/CERN/students",
    },
    {
      title: "Summer Science Program (SSP)",
      description:
        "\
        هو تجربة تعليمية تركز على تقديم مشاريع بحثية حقيقية للطالب في مجاالت العلوم. يهدف هذا البرنامج إلى تعزيز التفكير\
        النقدي ومهارات البحث العلمي في بيئة تعليمية متميزة. يستهدف البرنامج بشكل خاص الطالب في سن ال15 واصغر من\
        19 سنه، حيث يوفر لهم الفرصة للعمل في فرق وتطوير مشاريع علمية. يتطلب االلتحاق بالبرنامج تقديم طلب يتضمن\
        مستوى أكاديمي جيد ورغبة قوية في التعلم.\
      ",
      linkLabel: "Program Link",
      linkUrl: "https://summerscience.org/",
    },
  ];

  return (
    <>
      <Header />

      <section className="bg-curlyBackground bg-no-repeat bg-cover bg-bottom w-full h-full">
        <ol className="relative border-s border-gray-200 dark:border-gray-700 pt-14 mx-12">
          <li className="last-of-type:mb-0 mb-20 pb-20 ms-6">
            {ProgramsData.map(
              ({ title, description, linkLabel, linkUrl }, index) => (
                <Template
                  key={index}
                  title={title}
                  description={description}
                  linkLabel={linkLabel}
                  linkUrl={linkUrl}
                />
              ),
            )}
          </li>
        </ol>
      </section>

      <Footer />
    </>
  );
}
